resume.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-09-06 Tue 14:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Sean Gallagher—Résumé</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Sean Gallagher">
<link
    href="https://cdn.simplecss.org/simple.min.css"
    rel="stylesheet"
    type="text/css"
/>
<link
    href="/styles/styles.css"
    rel="stylesheet"
    type="text/css"
/>
<link rel="stylesheet" href="/styles/resume.css" type="text/css" />
</head>
<body>
<header id="header" class="status">
<h1>Sean Gallagher</h1>
<nav>
  <a href="/">Home</a>
  <a href="/resume.html">Résumé</a>
  <a href="/build.html">How it's Made</a>
</nav>
</header>
<main id="content">
<section id="outline-container-orgb1fbb0d" class="outline-2 summary">
<h2 id="summary"><a id="orgb1fbb0d"></a>Summary</h2>
<div class="outline-text-2" id="text-summary">
<ul class="org-ul">
<li><span class="fas fa-phone"></span> <a href="tel:+15183626816">518.362.6816</a></li>
<li><span class="fas fa-envelope-open"></span> <a href="mailto:sean@gallaghersw.dev">sean@gallaghersw.dev</a></li>
<li><span class="fab fa-github"></span> <a href="https://github.com/seangllghr">seangllghr</a></li>
<li><span class="fas fa-folder"></span> <a href="https://gallaghersw.dev">gallaghersw.dev</a></li>
</ul>

<p>
Dedicated, self-motivated software engineering graduate
    seeking entry-level position.
Background and coursework in full-stack JavaScript and Python development,
    open-source software and Linux automation,
    and visual and architectural design.
11 years experience in customer-facing and instructional positions
    with 7 years leading teams of 5&#x2013;50 people
</p>
</div>
</section>
<section id="outline-container-org4f62588" class="outline-2 education">
<h2 id="education"><a id="org4f62588"></a>Education</h2>
<div class="outline-text-2" id="text-education">
</div>
<section id="outline-container-org0bf595d" class="outline-3 degree">
<h3 id="degree-bachelors"><a id="org0bf595d"></a>Southern New Hampshire University <i>Manchester, NH</i></h3>
<div class="outline-text-3" id="text-degree-bachelors">
<dl class="org-dl">
<dt>Date</dt><dd>Graduated April 2022</dd>
<dt>Degree</dt><dd>Bachelor of Science, Computer Science</dd>
<dt>Focus</dt><dd>Concentration in Software Engineering</dd>
<dt>Projects</dt><dd>Developed a full-stack application in TypeScript, Angular and Nest.js for capstone project;
coursework included object-oriented analysis and design,
3d graphics, and application development in Python, Java, Kotlin, and C++.</dd>
</dl>
</div>
</section>
<section id="outline-container-org0956d0e" class="outline-3 degree">
<h3 id="degree-associates"><a id="org0956d0e"></a>State University of New York Adirondack <i>Queensbury, NY</i></h3>
<div class="outline-text-3" id="text-degree-associates">
<dl class="org-dl">
<dt>Date</dt><dd>Graduated December 2012</dd>
<dt>Degree</dt><dd>Associates of Applied Arts and Sciences, Adventure Sports Leadership and Management</dd>
<dt>Focus</dt><dd>Dual Concentration in Snowsports Instruction and Challenge Course Facilitation &amp; Management</dd>
</dl>
</div>
</section>
<section id="outline-container-org81d1ae2" class="outline-3 degree">
<h3 id="degree-architecture-incomplete"><a id="org81d1ae2"></a>New York Institute of Technology <i>Old Westbury, NY</i></h3>
<div class="outline-text-3" id="text-degree-architecture-incomplete">
<dl class="org-dl">
<dt>Date</dt><dd>2008&#x2013;2010</dd>
<dt>Degree</dt><dd>Coursework towards Bachelor of Science, Architectural Technology</dd>
<dt>Focus</dt><dd></dd>

<dt>Projects</dt><dd>Completed coursework included Architectural Visualization,
Building Construction, and Design Fundamentals.</dd>
</dl>
</div>
</section>
</section>
<section id="outline-container-org806929b" class="outline-2 skills">
<h2 id="skills"><a id="org806929b"></a>Technical Skills</h2>
<div class="outline-text-2" id="text-skills">
</div>
<section id="outline-container-org9b7567e" class="outline-3 skill-category">
<h3 id="computer-languages"><a id="org9b7567e"></a>Languages:</h3>
<div class="outline-text-3" id="text-computer-languages">
<ul class="org-ul">
<li>Javascript/Typescript</li>
<li>HTML/CSS</li>
<li>Python</li>
<li>Bash</li>
<li>C/C++</li>
<li><span class="latex">L<span>a</span>T<span>e</span>X</span></li>
</ul>
</div>
</section>
<section id="outline-container-orgbfa2e0a" class="outline-3 skill-category">
<h3 id="tools-technologies"><a id="orgbfa2e0a"></a>Tools and Technologies</h3>
<div class="outline-text-3" id="text-tools-technologies">
<ul class="org-ul">
<li>JSON</li>
<li>Adobe Creative Cloud</li>
<li>AutoCAD</li>
<li>Autodesk Revit</li>
<li>Autodesk Inventor</li>
<li>Microsoft Office</li>
</ul>
</div>
</section>
<section id="outline-container-org36d9260" class="outline-3 skill-category">
<h3 id="systems"><a id="org36d9260"></a>Operating Systems</h3>
<div class="outline-text-3" id="text-systems">
<ul class="org-ul">
<li>Linux</li>
<li>Windows</li>
</ul>
</div>
</section>
</section>
<section id="outline-container-orgd6ff334" class="outline-2 experience">
<h2 id="experience"><a id="orgd6ff334"></a>Experience</h2>
<div class="outline-text-2" id="text-experience">
</div>
<section id="outline-container-orga86f721" class="outline-3 position">
<h3 id="orga86f721">Program Director</h3>
<div class="outline-text-3" id="text-orga86f721">
<dl class="org-dl">
<dt>Period</dt><dd>Summer Seasonal, 2017&#x2013;2019</dd>
<dt>Employer</dt><dd>Camp Wakpominee, Twin Rivers Council, Boy Scouts of America</dd>
</dl>
</div>
<section id="outline-container-org1e41120" class="outline-4 duties">
<h4 id="org1e41120">Summary</h4>
<div class="outline-text-4" id="text-org1e41120">
<ul class="org-ul">
<li>Led a team of 10 program area directors responsible for a total of more than
50 program staff.</li>
<li>Designed hard copy documents related to camp program and activities,
using HTML/CSS-to-PDF toolchains, the Adobe suite, and Office, among others.</li>
<li>Installed and configured a dedicated Linux server
that provided common network resources within the camp office,
including network storage and printing for weekly paperwork.</li>
<li>Handled routine IT configuration tasks for the camp
office's heterogeneous network environment.</li>
</ul>
</div>
</section>
</section>
<section id="outline-container-org2e869ce" class="outline-3 position">
<h3 id="org2e869ce">Snow Pro</h3>
<div class="outline-text-3" id="text-org2e869ce">
<dl class="org-dl">
<dt>Period</dt><dd>Winter Seasonal, 2013&#x2013;19</dd>
<dt>Employer</dt><dd>Ski and Snowboard Schools of Aspen/Snowmass, Aspen Skiing Company</dd>
</dl>
</div>
<section id="outline-container-orgee1ce41" class="outline-4 duties">
<h4 id="orgee1ce41">Summary</h4>
<div class="outline-text-4" id="text-orgee1ce41">
<ul class="org-ul">
<li>Instructed an international clientele of children and adults in downhill skiing skills.</li>
<li>Facilitated guest interactions with other ASC departments and outside service providers.</li>
</ul>
</div>
</section>
</section>
<section id="outline-container-org0695e5f" class="outline-3 position">
<h3 id="org0695e5f">Aquatics Director</h3>
<div class="outline-text-3" id="text-org0695e5f">
<dl class="org-dl">
<dt>Period</dt><dd>Summer Seasonal 2016</dd>
<dt>Employer</dt><dd>Henderson Scout Reservation, Leatherstocking Council, Boy Scouts of America</dd>
</dl>
</div>
<section id="outline-container-org3b0e87c" class="outline-4 duties">
<h4 id="org3b0e87c">Summary</h4>
<div class="outline-text-4" id="text-org3b0e87c">
<ul class="org-ul">
<li>Managed a team of four aquatics instructors
responsible for lifeguard coverage and skill instruction.</li>
</ul>
</div>
</section>
</section>
<section id="outline-container-orgbd11dec" class="outline-3 position">
<h3 id="orgbd11dec">Aquatics Director</h3>
<div class="outline-text-3" id="text-orgbd11dec">
<dl class="org-dl">
<dt>Period</dt><dd>Summer Seasonal 2013&#x2013;2015</dd>
<dt>Employer</dt><dd>Camp Wakpominee, Twin Rivers Council, Boy Scouts of America</dd>
</dl>
</div>
</section>
</section>
<section id="outline-container-orgcc60bb5" class="outline-2 volunteer">
<h2 id="volunteer"><a id="orgcc60bb5"></a>Volunteer Experience</h2>
<div class="outline-text-2" id="text-volunteer">
</div>
<section id="outline-container-org4c4fdd4" class="outline-3 position">
<h3 id="org4c4fdd4">Committee Member</h3>
<div class="outline-text-3" id="text-org4c4fdd4">
<dl class="org-dl">
<dt>Period</dt><dd>2013&#x2013;Present</dd>
<dt>Organization</dt><dd>Council Aquatics Committee, Twin Rivers Council, Boy Scouts of America</dd>
</dl>
</div>
<section id="outline-container-org2ce6ffc" class="outline-4 duties">
<h4 id="org2ce6ffc">Summary</h4>
<div class="outline-text-4" id="text-org2ce6ffc">
<ul class="org-ul">
<li>Kept and published minutes for regular meetings
using  <span class="latex">L<span>a</span>T<span>e</span>X</span>
and Emacs org-mode</li>
<li>Designed, using Adobe Illustrator, a patch recognizing dedication to aquatics programs</li>
<li>Facilitated an annual pre-camp training program for aquatics staff from both
council camps</li>
</ul>
</div>
</section>
</section>
<section id="outline-container-org0724593" class="outline-3 position">
<h3 id="org0724593">Aquatics Section Faculty</h3>
<div class="outline-text-3" id="text-org0724593">
<dl class="org-dl">
<dt>Period</dt><dd>June 2015&#x2013;June 2019</dd>
<dt>Organization</dt><dd>National Camping School Adirondack Section, Boy Scouts of America</dd>
</dl>
</div>
<section id="outline-container-orgacea45f" class="outline-4 duties">
<h4 id="orgacea45f">Summary</h4>
<div class="outline-text-4" id="text-orgacea45f">
<ul class="org-ul">
<li>Taught water rescue, swimming, and boating skills to aquatics director
candidates</li>
<li>Trained candidates in crucial managerial soft skills, including interpersonal
interaction, conflict resolution, and effective teaching</li>
</ul>
</div>
</section>
</section>
</section>
<section id="outline-container-org97635e1" class="outline-2 languages">
<h2 id="languages"><a id="org97635e1"></a>Languages Spoken</h2>
<div class="outline-text-2" id="text-languages">
<p>
Fluent in English (native speaker) and Spanish.
</p>
</div>
</section>
</main>
<footer id="footer" class="status">
<p>&copy;&thinsp;2021&ndash;2022 Sean Gallagher<br><a href="mailto:seangllghr@gmail.com">seangllghr@gmail.com</a></p>
</footer>
</body>
</html>
